; domain
(define (domain healthcare-delivery)

  (:requirements :strips :typing)

  (:types
    robot box content location patient - object
    carrier-robot escort-robot - robot
    aspirin scalpel tongue-depressor - content
  )

  (:predicates
    ;; --- Is content of type ... ---
    (is-aspirin ?c - content)
    (is-tongue-depressor ?c - content)
    (is-scalpel ?c - content)

    ;; --- Location & Connection ---
    (at ?x - object ?l - location)
    (connected ?from - location ?to - location)

    ;; --- Box State ---
    (has-content ?b - box  ?c - content)
    (empty ?b - box)
    (carrying ?r - carrier-robot ?b - box)
    
    ;; --- Escorting Patients ---
    (accompanying ?r - escort-robot ?p - patient)

    (empty-handed ?r - robot)

    ;; --- Delivered status (for goals) ---
    (patient-at-unit ?p - patient ?u - location)
  )

  ;; --- ACTIONS ---

  ;; Robot Movement
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and
      (at ?r ?from)
      (connected ?from ?to)
    )
    :effect (and
      (at ?r ?to)
      (not (at ?r ?from))
    )
  )

  (:action move-with-box
    :parameters (?r - carrier-robot ?b - box ?from - location ?to - location)
    :precondition (and
      (at ?r ?from)
      (at ?b ?from)
      (connected ?from ?to)
      (carrying ?r ?b)
    )
    :effect (and
      (at ?r ?to)
      (not (at ?r ?from))
      (at ?b ?to)
      (not (at ?b ?from))
    )
  )

  (:action move-with-patient
    :parameters (?r - escort-robot ?p - patient ?from - location ?to - location)
    :precondition (and
      (at ?r ?from)
      (at ?p ?from)
      (connected ?from ?to)
      (accompanying ?r ?p)
    )
    :effect (and
      (at ?r ?to)
      (not (at ?r ?from))
      (at ?p ?to)
      (not (at ?p ?from))
    )
  )

  ;; Carrying a box
  (:action pickup-box
    :parameters (?r - carrier-robot ?b - box ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?b ?l)
      (empty-handed ?r)
    )
    :effect (and
      (carrying ?r ?b)
      (not (empty-handed ?r))
    )
  )

  (:action drop-box
    :parameters (?r - carrier-robot ?b - box ?l - location)
    :precondition (and
      (carrying ?r ?b)
      (at ?r ?l)
    )
    :effect (and
      (at ?b ?l)
      (not (carrying ?r ?b))
      (empty-handed ?r)
    )
  )

  ;; Fill box with content
  (:action fill-box
    :parameters (?r - carrier-robot ?b - box ?c - content ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?b ?l)
      (at ?c ?l)
      (empty ?b)
    )
    :effect (and
      (has-content ?b ?c)
      (not (empty ?b))
    )
  )

  ;; Empty box at medical unit
  (:action empty-box
    :parameters (?r - carrier-robot ?b - box ?c - content ?u - location)
    :precondition (and
      (carrying ?r ?b)
      (has-content ?b ?c)
      (at ?r ?u)
    )
    :effect (and
      (at ?c ?u)
      (empty ?b)
      (not (has-content ?b ?c))
    )
  )

  ;; Deliver full box to medical unit (without unpacking)
  (:action deliver-box
    :parameters (?r - carrier-robot ?b - box ?u - location)
    :precondition (and
      (carrying ?r ?b)
      (at ?r ?u)
    )
    :effect (and
      (at ?b ?u)
      (not (carrying ?r ?b))
    )
  )

  ;; Escorting patients
  (:action pickup-patient
    :parameters (?r - escort-robot ?p - patient ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?p ?l)
      (empty-handed ?r)
    )
    :effect (and
      (accompanying ?r ?p)
      (not (empty-handed ?r))
    )
  )

  (:action drop-patient
    :parameters (?r - escort-robot ?p - patient ?u - location)
    :precondition (and
      (accompanying ?r ?p)
      (at ?r ?u)
    )
    :effect (and
      (patient-at-unit ?p ?u)
      (not (accompanying ?r ?p))
      (empty-handed ?r)
    )
  )
)

; problem
(define (problem healthcare-problem-1)
  (:domain healthcare-delivery)

  ;; OBJECTS
  (:objects
    ;; Locations (unit14 unit 4 at facility 1)
    central-warehouse entrance facility1 facility2 unit11 unit12 unit13 unit14 unit21 unit22 unit23 unit24 - location

    ;; Robots
    boxbot1 - carrier-robot
    patientbot1 - escort-robot

    ;; Contents
    scalpel1 scalpel2 - scalpel
    aspirin1 - aspirin
    tongue-depressor1 tongue-depressor2 - tongue-depressor

    ;; Boxes
    box1 box2 - box

    ;; Patients
    alice bob - patient
  )

  ;; INITIAL STATE
  (:init
    ;; Content types
    (is-scalpel scalpel1)
    (is-scalpel scalpel2)
    (is-aspirin aspirin1)
    (is-tongue-depressor tongue-depressor1)
    (is-tongue-depressor tongue-depressor2)

    ;; Connections
    (connected central-warehouse entrance)
    (connected entrance central-warehouse)
    (connected entrance facility1)
    (connected facility1 entrance)

    (connected facility1 unit11)
    (connected facility1 unit12)
    (connected facility1 unit13)
    (connected facility1 unit14)
    (connected unit11 facility1)
    (connected unit12 facility1)
    (connected unit13 facility1)
    (connected unit14 facility1)

    (connected facility2 unit21)
    (connected facility2 unit22)
    (connected facility2 unit23)
    (connected facility2 unit24)
    (connected unit21 facility2)
    (connected unit22 facility2)
    (connected unit23 facility2)
    (connected unit24 facility2)

    (connected facility1 facility2)
    (connected facility2 facility1)

    ;; Robots initial position
    (at boxbot1 central-warehouse)
    (at patientbot1 entrance)

    (empty-handed boxbot1)
    (empty-handed patientbot1)

    ;; Boxes
    (at box1 central-warehouse)
    (at box2 central-warehouse)
    (empty box1)
    (empty box2)

    ;; Contents
    (at scalpel1 central-warehouse)
    (at scalpel2 central-warehouse)
    (at aspirin1 central-warehouse)
    (at tongue-depressor1 central-warehouse)
    (at tongue-depressor2 central-warehouse)
    
    ;; Patients
    (at alice entrance)
    (at bob entrance)
  )

  ;; GOALS
  (:goal (and
    (at scalpel1 unit11)
    (at aspirin1 unit21)
    (at tongue-depressor1 unit22)
    (at tongue-depressor2 unit22)
    (patient-at-unit alice unit14)
    (patient-at-unit bob unit24)
  ))
)

; plan
1. (pickup-box boxbot1 box2 central-warehouse)
   deleted: (empty-handed boxbot1)
   added: (carrying boxbot1 box2)
   goals met: 0 of 6
2. (pickup-patient patientbot1 alice entrance)
   deleted: (empty-handed patientbot1)
   added: (accompanying patientbot1 alice)
   goals met: 0 of 6
3. (move patientbot1 entrance facility1)
   deleted: (at patientbot1 entrance)
   added: (at patientbot1 facility1)
   goals met: 0 of 6
4. (move patientbot1 facility1 unit14)
   deleted: (at patientbot1 facility1)
   added: (at patientbot1 unit14)
   goals met: 0 of 6
5. (drop-patient patientbot1 alice unit14)
   deleted: (accompanying patientbot1 alice)
   added: (patient-at-unit alice unit14) (empty-handed patientbot1)
   goals met: 1 of 6
6. (move patientbot1 unit14 facility1)
   deleted: (at patientbot1 unit14)
   added: (at patientbot1 facility1)
   goals met: 1 of 6
7. (move patientbot1 facility1 entrance)
   deleted: (at patientbot1 facility1)
   added: (at patientbot1 entrance)
   goals met: 1 of 6
8. (pickup-patient patientbot1 bob entrance)
   deleted: (empty-handed patientbot1)
   added: (accompanying patientbot1 bob)
   goals met: 1 of 6
9. (move patientbot1 entrance facility1)
   deleted: (at patientbot1 entrance)
   added: (at patientbot1 facility1)
   goals met: 1 of 6
10. (move patientbot1 facility1 facility2)
   deleted: (at patientbot1 facility1)
   added: (at patientbot1 facility2)
   goals met: 1 of 6
11. (move patientbot1 facility2 unit24)
   deleted: (at patientbot1 facility2)
   added: (at patientbot1 unit24)
   goals met: 1 of 6
12. (drop-patient patientbot1 bob unit24)
   deleted: (accompanying patientbot1 bob)
   added: (patient-at-unit bob unit24) (empty-handed patientbot1)
   goals met: 2 of 6
13. (fill-box boxbot1 box2 aspirin1 central-warehouse)
   deleted: (empty box2)
   added: (has-content box2 aspirin1)
   goals met: 2 of 6
14. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 2 of 6
15. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 2 of 6
16. (move boxbot1 facility1 facility2)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 facility2)
   goals met: 2 of 6
17. (move boxbot1 facility2 unit21)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 unit21)
   goals met: 2 of 6
18. (empty-box boxbot1 box2 aspirin1 unit21)
   deleted: (has-content box2 aspirin1)
   added: (at aspirin1 unit21) (empty box2)
   goals met: 3 of 6
19. (move boxbot1 unit21 facility2)
   deleted: (at boxbot1 unit21)
   added: (at boxbot1 facility2)
   goals met: 3 of 6
20. (move boxbot1 facility2 facility1)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 facility1)
   goals met: 3 of 6
21. (move boxbot1 facility1 entrance)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 entrance)
   goals met: 3 of 6
22. (move boxbot1 entrance central-warehouse)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 central-warehouse)
   goals met: 3 of 6
23. (fill-box boxbot1 box2 tongue-depressor1 central-warehouse)
   deleted: (empty box2)
   added: (has-content box2 tongue-depressor1)
   goals met: 3 of 6
24. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 3 of 6
25. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 3 of 6
26. (move boxbot1 facility1 facility2)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 facility2)
   goals met: 3 of 6
27. (move boxbot1 facility2 unit22)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 unit22)
   goals met: 3 of 6
28. (empty-box boxbot1 box2 tongue-depressor1 unit22)
   deleted: (has-content box2 tongue-depressor1)
   added: (at tongue-depressor1 unit22) (empty box2)
   goals met: 4 of 6
29. (move boxbot1 unit22 facility2)
   deleted: (at boxbot1 unit22)
   added: (at boxbot1 facility2)
   goals met: 4 of 6
30. (move boxbot1 facility2 facility1)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 facility1)
   goals met: 4 of 6
31. (move boxbot1 facility1 entrance)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 entrance)
   goals met: 4 of 6
32. (move boxbot1 entrance central-warehouse)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 central-warehouse)
   goals met: 4 of 6
33. (fill-box boxbot1 box2 tongue-depressor2 central-warehouse)
   deleted: (empty box2)
   added: (has-content box2 tongue-depressor2)
   goals met: 4 of 6
34. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 4 of 6
35. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 4 of 6
36. (move boxbot1 facility1 facility2)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 facility2)
   goals met: 4 of 6
37. (move boxbot1 facility2 unit22)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 unit22)
   goals met: 4 of 6
38. (empty-box boxbot1 box2 tongue-depressor2 unit22)
   deleted: (has-content box2 tongue-depressor2)
   added: (at tongue-depressor2 unit22) (empty box2)
   goals met: 5 of 6
39. (move boxbot1 unit22 facility2)
   deleted: (at boxbot1 unit22)
   added: (at boxbot1 facility2)
   goals met: 5 of 6
40. (move boxbot1 facility2 facility1)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 facility1)
   goals met: 5 of 6
41. (move boxbot1 facility1 entrance)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 entrance)
   goals met: 5 of 6
42. (move boxbot1 entrance central-warehouse)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 central-warehouse)
   goals met: 5 of 6
43. (fill-box boxbot1 box2 scalpel1 central-warehouse)
   deleted: (empty box2)
   added: (has-content box2 scalpel1)
   goals met: 5 of 6
44. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 5 of 6
45. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 5 of 6
46. (move boxbot1 facility1 unit11)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 unit11)
   goals met: 5 of 6
47. (empty-box boxbot1 box2 scalpel1 unit11)
   deleted: (has-content box2 scalpel1)
   added: (at scalpel1 unit11) (empty box2)
   goals met: 6 of 6
